Revit 2027 API
BuiltInFailures.CreationFailures.CannotDrawSingularSlantedWall Property
 Cannot create wall - it would intersect itself. Reduce the wall's height or slant.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawSingularSlantedWall { get; }
Public Shared ReadOnly Property CannotDrawSingularSlantedWall As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawSingularSlantedWall {
	FailureDefinitionId^ get ();
}
static member CannotDrawSingularSlantedWall : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace